# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMap..::..Erase Method
DefinitionBindingMap Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Definition key
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	key As Definition _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Definition^ key
)
```

# ### Parameters
key
    Type: Autodesk.Revit.DB..::..Definition
# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace